### LAB 8 <br>Name : Alok Kumar <br> Admission No. : 22MT0059

In [27]:
import mysql.connector as sc
import time 
start = time.time()
myconn = sc.connect(user='ak', host='localhost', database='dbmslab')
end = time.time()
print("Time Taken to Establish Connection(sec): ",end-start)
print(myconn)

Time Taken to Establish Connection(sec):  0.02234029769897461
<mysql.connector.connection_cext.CMySQLConnection object at 0x0000023EF4321F40>

In [28]:
## Cursor
cursor = myconn.cursor(buffered =True)

#### 1. Given input as salary of three months (jan, feb, march), <br>write a program that returns the total salary for quarter 1 (Q1).

In [9]:
#declaring and defining function
cursor.execute("set global log_bin_trust_function_creators = 1")
cursor.execute("create function calc_quarter (jan_salary double ,feb_salary double  , march_salary double) returns double begin declare result double; set result = jan_salary + feb_salary + march_salary ; return result; end")

In [22]:
print("Enter a salary to calculate the total salary for quarter1")
jan_salary = float(input("Enter salary of January :"))
feb_salary = float(input("Enter salary of February:"))
march_salary = float(input("Enter salary of March : "))


val = (jan_salary,feb_salary ,march_salary)
sql = "set @x = calc_quarter(%s,%s,%s ) "
cursor.execute(sql,val)
cursor.execute("select @x")
myresult = cursor.fetchall()
for x in myresult:
    print("The total salary for quarter 1 : " ,x)

Enter a salary to calculate the total salary for quarter1
Enter salary of January :40000
Enter salary of February:41000
Enter salary of March : 40500
The total salary for quarter 1 :  (121500.0,)

#### 3. Alter the existing instructor table and add a column of age and fill in the values in it.

In [30]:
cursor.execute("ALTER TABLE instructor ADD age int(10) DEFAULT 42")

In [29]:
cursor.execute("select * from instructor")
myresult = cursor.fetchall()
for x in myresult:
    print(x)

('10212', 'Tom', 'Biology', None, 42)
('12454', 'Sumit', 'Electrical', 56000.0, 34)
('32343', 'El Said', 'History', 60000.0, 54)
('33456', 'Gold', 'Physics', 87000.0, 23)
('4321', 'hgfd', 'kjhgfds', 46654.0, 34)
('45565', 'Katz', 'Comp. Sci.', 75000.0, 56)
('45676', 'Amit Kumar', 'Chemistry', 450000.0, 36)
('58583', 'Califieri', 'History', 62000.0, 31)
('58687', 'Ashu', 'Biology', 56000.0, 32)
('67878', 'Ritik', 'Mechanical', 50000.0, 42)
('76543', 'Singh', 'Finance', 80000.0, 45)
('76766', 'Crick', 'Biology', 72000.0, 24)
('78967779', 'Ajay', 'Mining', 340000.0, 29)
('83821', 'Brandt', 'Comp. Sci.', 92000.0, 32)
('85895', 'RAJ', 'Music', 42000.0, 33)
('98345', 'Kim', 'Elec. Eng.', 80000.0, 42)

#### 2.Create table ‘instructor’ with the columns as ID, name, dept_name,salary, age. Add the following tuples to the table.<br>(10101,'Srinivasan','Comp. Sci.',65000, 34),<br> (12121,'Wu','Finance',90000, 38),<br>(15151,'Mozart','Music',40000, 45),<br> (22222,'Einstein','Physics',95000, 55)

In [34]:
 mySql_insert_query = """INSERT INTO instructor (Id, name, dept_name, salary , Age) 
                           VALUES (%s, %s, %s, %s,%s) """
records_to_insert = [('10101','Srinivasan','Comp. Sci.',65000, 34), 
                     ('12121','Wu','Finance',90000, 38),
                     ('22222','Einstein','Physics',95000, 55),
                    ('15151','Mozart','Music',40000, 45)]


cursor.executemany(mySql_insert_query, records_to_insert)
myconn.commit()
print(cursor.rowcount, "Record inserted successfully into instructor table")

4 Record inserted successfully into instructor table

#### 4.Create a function that helps distinguish whether an instructor is eligible for sabbatical or not.<br> An instructor can avail sabbatical only if his/her age is greater than 40.<br>So, write a program that takes as input an integer (representing age) and <br>returns affirmatively if the integer is greater than 40.

In [36]:
#declaring and defining function
cursor.execute("set global log_bin_trust_function_creators = 1")
cursor.execute("create function isSabbatical (age int(10)) returns int begin declare result TINYINT; set result = age > 40; return result; end")

In [38]:
# Print the name of all instructor who are eligible  for sabbatical
cursor.execute("select name from instructor where isSabbatical(age ) = 1")
myresult = cursor.fetchall()
print("Instructors who are eligible  for sabbatical")
for x in myresult:
    print(x)

Instructors who are eligible  for sabbatical
('Mozart',)
('Einstein',)
('El Said',)
('Katz',)
('Tom',)
('Ritik',)
('Singh',)
('Kim',)

In [39]:
from git import Repo
# Initialize a new Git repository or open an existing one
repo_path = os.getcwd()
repo = Repo.init(repo_path)

# Add the database.py file to the repository
repo.index.add(['lab_8.ipynb'])

# Commit the changes
repo.index.commit('lab_8.ipynb')

# Push the changes to GitHub
origin = repo.remote(name='origin')
origin.push()

NameError: name 'os' is not defined